musicapp/app/controllers/bands_controller.rb

    def update
        # debugger
        if @band.update(band_params)
---
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Slanderkp"], ["updated_at", "2022-09-21 01:34:34.889990"], ["id", 2]]

    def set_band
        @band = Band.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]